In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
dados = pd.read_csv('dados/dados.csv')
dados.head()

   UF  Sexo  Idade  Cor  Anos de Estudo  Renda    Altura
0  11     0     23    8              12    800  1.603808
1  11     1     23    2              12   1150  1.739790
2  11     1     35    8              15    880  1.760444
3  11     0     46    2               6   3500  1.783158
4  11     1     47    8               9    150  1.690631

In [12]:
# mad() é o desvio médio absoluto
# std() é o desvio padrão
# var() é a variância
dados.Renda.aggregate(['mean','median','mad','var','std']).round(2)

mean          2000.38
median        1200.00
mad           1526.50
var       11044906.01
std           3323.39
Name: Renda, dtype: float64

In [13]:
dados.Altura.aggregate(['mean','median','mad','var','std'])

mean      1.699512
median    1.699325
mad       0.063601
var       0.006355
std       0.079717
Name: Altura, dtype: float64

In [14]:
dataset = pd.DataFrame({
    'Sexo': ['H', 'M', 'M', 'M', 'M', 'H', 'H', 'H', 'M', 'M'],
    'Idade': [53, 72, 54, 27, 30, 40, 58, 32, 44, 51]
})
dataset.std()

Idade    14.18489
dtype: float64

In [15]:
dataset.groupby('Sexo').std()

          Idade
Sexo
H     11.898879
M     16.645320